GopalSaraf/Practicals/PSDL/include/proc/pic16f19185.h
extern volatile __bit                   TRISB0              __at(0x98);	// @ (0x13 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0x99);	// @ (0x13 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0x9A);	// @ (0x13 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0x9B);	// @ (0x13 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x9C);	// @ (0x13 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x9E);	// @ (0x13 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x9F);	// @ (0x13 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0xA1);	// @ (0x14 * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0xA2);	// @ (0x14 * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0xA3);	// @ (0x14 * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0xA4);	// @ (0x14 * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0xA6);	// @ (0x14 * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0xA7);	// @ (0x14 * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// TRISD<TRISD0>
extern volatile __bit                   TRISD0              __at(0xA8);	// @ (0x15 * 8 + 0)
#define                                 TRISD0_bit          _BIT_ACCESS(TRISD,0)
// TRISD<TRISD1>
extern volatile __bit                   TRISD1              __at(0xA9);	// @ (0x15 * 8 + 1)
#define                                 TRISD1_bit          _BIT_ACCESS(TRISD,1)
// TRISD<TRISD2>
extern volatile __bit                   TRISD2              __at(0xAA);	// @ (0x15 * 8 + 2)
#define                                 TRISD2_bit          _BIT_ACCESS(TRISD,2)
// TRISD<TRISD3>
extern volatile __bit                   TRISD3              __at(0xAB);	// @ (0x15 * 8 + 3)
#define                                 TRISD3_bit          _BIT_ACCESS(TRISD,3)
// TRISD<TRISD4>
extern volatile __bit                   TRISD4              __at(0xAC);	// @ (0x15 * 8 + 4)
#define                                 TRISD4_bit          _BIT_ACCESS(TRISD,4)
// TRISD<TRISD5>
extern volatile __bit                   TRISD5              __at(0xAD);	// @ (0x15 * 8 + 5)
#define                                 TRISD5_bit          _BIT_ACCESS(TRISD,5)
// TRISD<TRISD6>
extern volatile __bit                   TRISD6              __at(0xAE);	// @ (0x15 * 8 + 6)
#define                                 TRISD6_bit          _BIT_ACCESS(TRISD,6)
// TRISD<TRISD7>
extern volatile __bit                   TRISD7              __at(0xAF);	// @ (0x15 * 8 + 7)
#define                                 TRISD7_bit          _BIT_ACCESS(TRISD,7)
// TRISE<TRISE0>
extern volatile __bit                   TRISE0              __at(0xB0);	// @ (0x16 * 8 + 0)
#define                                 TRISE0_bit          _BIT_ACCESS(TRISE,0)
// TRISE<TRISE1>
extern volatile __bit                   TRISE1              __at(0xB1);	// @ (0x16 * 8 + 1)
#define                                 TRISE1_bit          _BIT_ACCESS(TRISE,1)
// TRISE<TRISE2>
extern volatile __bit                   TRISE2              __at(0xB2);	// @ (0x16 * 8 + 2)
#define                                 TRISE2_bit          _BIT_ACCESS(TRISE,2)
// TRISF<TRISF0>
extern volatile __bit                   TRISF0              __at(0xB8);	// @ (0x17 * 8 + 0)
#define                                 TRISF0_bit          _BIT_ACCESS(TRISF,0)
// TRISF<TRISF1>
extern volatile __bit                   TRISF1              __at(0xB9);	// @ (0x17 * 8 + 1)
#define                                 TRISF1_bit          _BIT_ACCESS(TRISF,1)
// TRISF<TRISF2>
extern volatile __bit                   TRISF2              __at(0xBA);	// @ (0x17 * 8 + 2)
#define                                 TRISF2_bit          _BIT_ACCESS(TRISF,2)
// TRISF<TRISF3>
extern volatile __bit                   TRISF3              __at(0xBB);	// @ (0x17 * 8 + 3)
#define                                 TRISF3_bit          _BIT_ACCESS(TRISF,3)
// TRISF<TRISF4>
extern volatile __bit                   TRISF4              __at(0xBC);	// @ (0x17 * 8 + 4)
#define                                 TRISF4_bit          _BIT_ACCESS(TRISF,4)
// TRISF<TRISF5>
extern volatile __bit                   TRISF5              __at(0xBD);	// @ (0x17 * 8 + 5)
#define                                 TRISF5_bit          _BIT_ACCESS(TRISF,5)
// TRISF<TRISF6>
extern volatile __bit                   TRISF6              __at(0xBE);	// @ (0x17 * 8 + 6)
#define                                 TRISF6_bit          _BIT_ACCESS(TRISF,6)
// TRISF<TRISF7>
extern volatile __bit                   TRISF7              __at(0xBF);	// @ (0x17 * 8 + 7)
#define                                 TRISF7_bit          _BIT_ACCESS(TRISF,7)
// SMT1STAT<TS>
extern volatile __bit                   TS                  __at(0x24D2);	// @ (0x49A * 8 + 2)
#define                                 TS_bit              _BIT_ACCESS(SMT1STAT,2)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x4865);	// @ (0x90C * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x4864);	// @ (0x90C * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// PIE3<TX1IE>
extern volatile __bit                   TX1IE               __at(0x38CC);	// @ (0x719 * 8 + 4)
#define                                 TX1IE_bit           _BIT_ACCESS(PIE3,4)
// PIR3<TX1IF>
extern volatile __bit                   TX1IF               __at(0x387C);	// @ (0x70F * 8 + 4)
#define                                 TX1IF_bit           _BIT_ACCESS(PIR3,4)
// TX1PPS<TX1PPS0>
extern volatile __bit                   TX1PPS0             __at(0xF660);	// @ (0x1ECC * 8 + 0)
#define                                 TX1PPS0_bit         _BIT_ACCESS(TX1PPS,0)
// TX1PPS<TX1PPS1>
extern volatile __bit                   TX1PPS1             __at(0xF661);	// @ (0x1ECC * 8 + 1)
#define                                 TX1PPS1_bit         _BIT_ACCESS(TX1PPS,1)
// TX1PPS<TX1PPS2>
extern volatile __bit                   TX1PPS2             __at(0xF662);	// @ (0x1ECC * 8 + 2)
#define                                 TX1PPS2_bit         _BIT_ACCESS(TX1PPS,2)
// TX1PPS<TX1PPS3>
extern volatile __bit                   TX1PPS3             __at(0xF663);	// @ (0x1ECC * 8 + 3)
#define                                 TX1PPS3_bit         _BIT_ACCESS(TX1PPS,3)
// TX1PPS<TX1PPS4>
extern volatile __bit                   TX1PPS4             __at(0xF664);	// @ (0x1ECC * 8 + 4)
#define                                 TX1PPS4_bit         _BIT_ACCESS(TX1PPS,4)
// PIE3<TX2IE>
extern volatile __bit                   TX2IE               __at(0x38CE);	// @ (0x719 * 8 + 6)
#define                                 TX2IE_bit           _BIT_ACCESS(PIE3,6)
// PIR3<TX2IF>
extern volatile __bit                   TX2IF               __at(0x387E);	// @ (0x70F * 8 + 6)
#define                                 TX2IF_bit           _BIT_ACCESS(PIR3,6)
// TX2PPS<TX2PPS0>
extern volatile __bit                   TX2PPS0             __at(0xF670);	// @ (0x1ECE * 8 + 0)
#define                                 TX2PPS0_bit         _BIT_ACCESS(TX2PPS,0)
// TX2PPS<TX2PPS1>
extern volatile __bit                   TX2PPS1             __at(0xF671);	// @ (0x1ECE * 8 + 1)
#define                                 TX2PPS1_bit         _BIT_ACCESS(TX2PPS,1)
// TX2PPS<TX2PPS2>
extern volatile __bit                   TX2PPS2             __at(0xF672);	// @ (0x1ECE * 8 + 2)
#define                                 TX2PPS2_bit         _BIT_ACCESS(TX2PPS,2)
// TX2PPS<TX2PPS3>
extern volatile __bit                   TX2PPS3             __at(0xF673);	// @ (0x1ECE * 8 + 3)
#define                                 TX2PPS3_bit         _BIT_ACCESS(TX2PPS,3)
// TX2PPS<TX2PPS4>
extern volatile __bit                   TX2PPS4             __at(0xF674);	// @ (0x1ECE * 8 + 4)
#define                                 TX2PPS4_bit         _BIT_ACCESS(TX2PPS,4)
// SSP1STAT<UA>
extern volatile __bit                   UA                  __at(0xC79);	// @ (0x18F * 8 + 1)
#define                                 UA_bit              _BIT_ACCESS(SSP1STAT,1)
// SSP1STAT<UA1>
extern volatile __bit                   UA1                 __at(0xC79);	// @ (0x18F * 8 + 1)
#define                                 UA1_bit             _BIT_ACCESS(SSP1STAT,1)
// PMD4<UART1MD>
extern volatile __bit                   UART1MD             __at(0x3CD6);	// @ (0x79A * 8 + 6)
#define                                 UART1MD_bit         _BIT_ACCESS(PMD4,6)
// PMD4<UART2MD>
extern volatile __bit                   UART2MD             __at(0x3CD7);	// @ (0x79A * 8 + 7)
#define                                 UART2MD_bit         _BIT_ACCESS(PMD4,7)
// ADUTHL<UTH0>
extern volatile __bit                   UTH0                __at(0x470);	// @ (0x8E * 8 + 0)
#define                                 UTH0_bit            _BIT_ACCESS(ADUTHL,0)
// ADUTHL<UTH1>
extern volatile __bit                   UTH1                __at(0x471);	// @ (0x8E * 8 + 1)
#define                                 UTH1_bit            _BIT_ACCESS(ADUTHL,1)
// ADUTHH<UTH10>
extern volatile __bit                   UTH10               __at(0x47A);	// @ (0x8F * 8 + 2)
#define                                 UTH10_bit           _BIT_ACCESS(ADUTHH,2)
// ADUTHH<UTH11>
extern volatile __bit                   UTH11               __at(0x47B);	// @ (0x8F * 8 + 3)
#define                                 UTH11_bit           _BIT_ACCESS(ADUTHH,3)
// ADUTHH<UTH12>
extern volatile __bit                   UTH12               __at(0x47C);	// @ (0x8F * 8 + 4)
#define                                 UTH12_bit           _BIT_ACCESS(ADUTHH,4)
// ADUTHH<UTH13>
extern volatile __bit                   UTH13               __at(0x47D);	// @ (0x8F * 8 + 5)
#define                                 UTH13_bit           _BIT_ACCESS(ADUTHH,5)
// ADUTHH<UTH14>
extern volatile __bit                   UTH14               __at(0x47E);	// @ (0x8F * 8 + 6)
#define                                 UTH14_bit           _BIT_ACCESS(ADUTHH,6)
// ADUTHH<UTH15>
extern volatile __bit                   UTH15               __at(0x47F);	// @ (0x8F * 8 + 7)
#define                                 UTH15_bit           _BIT_ACCESS(ADUTHH,7)
// ADUTHL<UTH2>
extern volatile __bit                   UTH2                __at(0x472);	// @ (0x8E * 8 + 2)
#define                                 UTH2_bit            _BIT_ACCESS(ADUTHL,2)
// ADUTHL<UTH3>
extern volatile __bit                   UTH3                __at(0x473);	// @ (0x8E * 8 + 3)
#define                                 UTH3_bit            _BIT_ACCESS(ADUTHL,3)
// ADUTHL<UTH4>
extern volatile __bit                   UTH4                __at(0x474);	// @ (0x8E * 8 + 4)
#define                                 UTH4_bit            _BIT_ACCESS(ADUTHL,4)
// ADUTHL<UTH5>
extern volatile __bit                   UTH5                __at(0x475);	// @ (0x8E * 8 + 5)
#define                                 UTH5_bit            _BIT_ACCESS(ADUTHL,5)
// ADUTHL<UTH6>
extern volatile __bit                   UTH6                __at(0x476);	// @ (0x8E * 8 + 6)
#define                                 UTH6_bit            _BIT_ACCESS(ADUTHL,6)
// ADUTHL<UTH7>
extern volatile __bit                   UTH7                __at(0x477);	// @ (0x8E * 8 + 7)
#define                                 UTH7_bit            _BIT_ACCESS(ADUTHL,7)
// ADUTHH<UTH8>
extern volatile __bit                   UTH8                __at(0x478);	// @ (0x8F * 8 + 0)
#define                                 UTH8_bit            _BIT_ACCESS(ADUTHH,0)
// ADUTHH<UTH9>
extern volatile __bit                   UTH9                __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 UTH9_bit            _BIT_ACCESS(ADUTHH,1)
// ADSTAT<UTHR>
extern volatile __bit                   UTHR                __at(0x8AE);	// @ (0x115 * 8 + 6)
#define                                 UTHR_bit            _BIT_ACCESS(ADSTAT,6)
// VB0GPR<VB0GPR0>
extern volatile __bit                   VB0GPR0             __at(0x7460);	// @ (0xE8C * 8 + 0)
#define                                 VB0GPR0_bit         _BIT_ACCESS(VB0GPR,0)
// VB0GPR<VB0GPR1>
extern volatile __bit                   VB0GPR1             __at(0x7461);	// @ (0xE8C * 8 + 1)
#define                                 VB0GPR1_bit         _BIT_ACCESS(VB0GPR,1)
// VB0GPR<VB0GPR2>
extern volatile __bit                   VB0GPR2             __at(0x7462);	// @ (0xE8C * 8 + 2)
#define                                 VB0GPR2_bit         _BIT_ACCESS(VB0GPR,2)
// VB0GPR<VB0GPR3>
extern volatile __bit                   VB0GPR3             __at(0x7463);	// @ (0xE8C * 8 + 3)
#define                                 VB0GPR3_bit         _BIT_ACCESS(VB0GPR,3)
// VB0GPR<VB0GPR4>
extern volatile __bit                   VB0GPR4             __at(0x7464);	// @ (0xE8C * 8 + 4)
#define                                 VB0GPR4_bit         _BIT_ACCESS(VB0GPR,4)
// VB0GPR<VB0GPR5>
extern volatile __bit                   VB0GPR5             __at(0x7465);	// @ (0xE8C * 8 + 5)
#define                                 VB0GPR5_bit         _BIT_ACCESS(VB0GPR,5)
// VB0GPR<VB0GPR6>
extern volatile __bit                   VB0GPR6             __at(0x7466);	// @ (0xE8C * 8 + 6)
#define                                 VB0GPR6_bit         _BIT_ACCESS(VB0GPR,6)
// VB0GPR<VB0GPR7>
extern volatile __bit                   VB0GPR7             __at(0x7467);	// @ (0xE8C * 8 + 7)
#define                                 VB0GPR7_bit         _BIT_ACCESS(VB0GPR,7)
// VB1GPR<VB1GPR0>
extern volatile __bit                   VB1GPR0             __at(0x7468);	// @ (0xE8D * 8 + 0)
#define                                 VB1GPR0_bit         _BIT_ACCESS(VB1GPR,0)
// VB1GPR<VB1GPR1>
extern volatile __bit                   VB1GPR1             __at(0x7469);	// @ (0xE8D * 8 + 1)
#define                                 VB1GPR1_bit         _BIT_ACCESS(VB1GPR,1)
// VB1GPR<VB1GPR2>
extern volatile __bit                   VB1GPR2             __at(0x746A);	// @ (0xE8D * 8 + 2)
#define                                 VB1GPR2_bit         _BIT_ACCESS(VB1GPR,2)
// VB1GPR<VB1GPR3>
extern volatile __bit                   VB1GPR3             __at(0x746B);	// @ (0xE8D * 8 + 3)
#define                                 VB1GPR3_bit         _BIT_ACCESS(VB1GPR,3)
// VB1GPR<VB1GPR4>
extern volatile __bit                   VB1GPR4             __at(0x746C);	// @ (0xE8D * 8 + 4)
#define                                 VB1GPR4_bit         _BIT_ACCESS(VB1GPR,4)
// VB1GPR<VB1GPR5>
extern volatile __bit                   VB1GPR5             __at(0x746D);	// @ (0xE8D * 8 + 5)
#define                                 VB1GPR5_bit         _BIT_ACCESS(VB1GPR,5)
// VB1GPR<VB1GPR6>
extern volatile __bit                   VB1GPR6             __at(0x746E);	// @ (0xE8D * 8 + 6)
#define                                 VB1GPR6_bit         _BIT_ACCESS(VB1GPR,6)
// VB1GPR<VB1GPR7>
extern volatile __bit                   VB1GPR7             __at(0x746F);	// @ (0xE8D * 8 + 7)
#define                                 VB1GPR7_bit         _BIT_ACCESS(VB1GPR,7)
// VB2GPR<VB2GPR0>
extern volatile __bit                   VB2GPR0             __at(0x7470);	// @ (0xE8E * 8 + 0)
#define                                 VB2GPR0_bit         _BIT_ACCESS(VB2GPR,0)
// VB2GPR<VB2GPR1>
extern volatile __bit                   VB2GPR1             __at(0x7471);	// @ (0xE8E * 8 + 1)
#define                                 VB2GPR1_bit         _BIT_ACCESS(VB2GPR,1)
// VB2GPR<VB2GPR2>
extern volatile __bit                   VB2GPR2             __at(0x7472);	// @ (0xE8E * 8 + 2)
#define                                 VB2GPR2_bit         _BIT_ACCESS(VB2GPR,2)
// VB2GPR<VB2GPR3>
extern volatile __bit                   VB2GPR3             __at(0x7473);	// @ (0xE8E * 8 + 3)
#define                                 VB2GPR3_bit         _BIT_ACCESS(VB2GPR,3)
// VB2GPR<VB2GPR4>
extern volatile __bit                   VB2GPR4             __at(0x7474);	// @ (0xE8E * 8 + 4)
#define                                 VB2GPR4_bit         _BIT_ACCESS(VB2GPR,4)
// VB2GPR<VB2GPR5>
extern volatile __bit                   VB2GPR5             __at(0x7475);	// @ (0xE8E * 8 + 5)
#define                                 VB2GPR5_bit         _BIT_ACCESS(VB2GPR,5)
// VB2GPR<VB2GPR6>
extern volatile __bit                   VB2GPR6             __at(0x7476);	// @ (0xE8E * 8 + 6)
#define                                 VB2GPR6_bit         _BIT_ACCESS(VB2GPR,6)
// VB2GPR<VB2GPR7>
extern volatile __bit                   VB2GPR7             __at(0x7477);	// @ (0xE8E * 8 + 7)
#define                                 VB2GPR7_bit         _BIT_ACCESS(VB2GPR,7)
// VB3GPR<VB3GPR0>
extern volatile __bit                   VB3GPR0             __at(0x7478);	// @ (0xE8F * 8 + 0)
#define                                 VB3GPR0_bit         _BIT_ACCESS(VB3GPR,0)
// VB3GPR<VB3GPR1>
extern volatile __bit                   VB3GPR1             __at(0x7479);	// @ (0xE8F * 8 + 1)
#define                                 VB3GPR1_bit         _BIT_ACCESS(VB3GPR,1)
// VB3GPR<VB3GPR2>
extern volatile __bit                   VB3GPR2             __at(0x747A);	// @ (0xE8F * 8 + 2)
#define                                 VB3GPR2_bit         _BIT_ACCESS(VB3GPR,2)
// VB3GPR<VB3GPR3>
extern volatile __bit                   VB3GPR3             __at(0x747B);	// @ (0xE8F * 8 + 3)
#define                                 VB3GPR3_bit         _BIT_ACCESS(VB3GPR,3)
// VB3GPR<VB3GPR4>
extern volatile __bit                   VB3GPR4             __at(0x747C);	// @ (0xE8F * 8 + 4)
#define                                 VB3GPR4_bit         _BIT_ACCESS(VB3GPR,4)
// VB3GPR<VB3GPR5>
extern volatile __bit                   VB3GPR5             __at(0x747D);	// @ (0xE8F * 8 + 5)
#define                                 VB3GPR5_bit         _BIT_ACCESS(VB3GPR,5)
// VB3GPR<VB3GPR6>
extern volatile __bit                   VB3GPR6             __at(0x747E);	// @ (0xE8F * 8 + 6)
#define                                 VB3GPR6_bit         _BIT_ACCESS(VB3GPR,6)
// VB3GPR<VB3GPR7>
extern volatile __bit                   VB3GPR7             __at(0x747F);	// @ (0xE8F * 8 + 7)
#define                                 VB3GPR7_bit         _BIT_ACCESS(VB3GPR,7)
// PCON1<VBATBOR>
extern volatile __bit                   VBATBOR             __at(0x40A0);	// @ (0x814 * 8 + 0)
#define                                 VBATBOR_bit         _BIT_ACCESS(PCON1,0)
// VREGCON<VREGPM>
extern volatile __bit                   VREGPM              __at(0x4091);	// @ (0x812 * 8 + 1)
#define                                 VREGPM_bit          _BIT_ACCESS(VREGCON,1)
// LCDPS<WA>
extern volatile __bit                   WA                  __at(0xE86C);	// @ (0x1D0D * 8 + 4)
#define                                 WA_bit              _BIT_ACCESS(LCDPS,4)
// SSP1CON1<WCOL>
extern volatile __bit                   WCOL                __at(0xC87);	// @ (0x190 * 8 + 7)
#define                                 WCOL_bit            _BIT_ACCESS(SSP1CON1,7)
// SSP1CON1<WCOL1>
extern volatile __bit                   WCOL1               __at(0xC87);	// @ (0x190 * 8 + 7)
#define                                 WCOL1_bit           _BIT_ACCESS(SSP1CON1,7)
// WEEKDAY<WDAY0>
extern volatile __bit                   WDAY0               __at(0x6090);	// @ (0xC12 * 8 + 0)
#define                                 WDAY0_bit           _BIT_ACCESS(WEEKDAY,0)
// WEEKDAY<WDAY1>
extern volatile __bit                   WDAY1               __at(0x6091);	// @ (0xC12 * 8 + 1)
#define                                 WDAY1_bit           _BIT_ACCESS(WEEKDAY,1)
// WEEKDAY<WDAY2>
extern volatile __bit                   WDAY2               __at(0x6092);	// @ (0xC12 * 8 + 2)
#define                                 WDAY2_bit           _BIT_ACCESS(WEEKDAY,2)
// WDTCON1<WDTCS0>
extern volatile __bit                   WDTCS0              __at(0x406C);	// @ (0x80D * 8 + 4)
#define                                 WDTCS0_bit          _BIT_ACCESS(WDTCON1,4)
// WDTCON1<WDTCS1>
extern volatile __bit                   WDTCS1              __at(0x406D);	// @ (0x80D * 8 + 5)
#define                                 WDTCS1_bit          _BIT_ACCESS(WDTCON1,5)
// WDTCON1<WDTCS2>
extern volatile __bit                   WDTCS2              __at(0x406E);	// @ (0x80D * 8 + 6)
#define                                 WDTCS2_bit          _BIT_ACCESS(WDTCON1,6)
// WDTCON0<WDTPS0>
extern volatile __bit                   WDTPS0              __at(0x4061);	// @ (0x80C * 8 + 1)
#define                                 WDTPS0_bit          _BIT_ACCESS(WDTCON0,1)
// WDTCON0<WDTPS1>
extern volatile __bit                   WDTPS1              __at(0x4062);	// @ (0x80C * 8 + 2)
#define                                 WDTPS1_bit          _BIT_ACCESS(WDTCON0,2)
// WDTCON0<WDTPS2>
extern volatile __bit                   WDTPS2              __at(0x4063);	// @ (0x80C * 8 + 3)
#define                                 WDTPS2_bit          _BIT_ACCESS(WDTCON0,3)
// WDTCON0<WDTPS3>
extern volatile __bit                   WDTPS3              __at(0x4064);	// @ (0x80C * 8 + 4)
#define                                 WDTPS3_bit          _BIT_ACCESS(WDTCON0,4)
// WDTCON0<WDTPS4>
extern volatile __bit                   WDTPS4              __at(0x4065);	// @ (0x80C * 8 + 5)
#define                                 WDTPS4_bit          _BIT_ACCESS(WDTCON0,5)
// WDTPSL<WDTPSCNT0>
extern volatile __bit                   WDTPSCNT0           __at(0x4070);	// @ (0x80E * 8 + 0)
#define                                 WDTPSCNT0_bit       _BIT_ACCESS(WDTPSL,0)
// WDTPSL<WDTPSCNT1>
extern volatile __bit                   WDTPSCNT1           __at(0x4071);	// @ (0x80E * 8 + 1)
#define                                 WDTPSCNT1_bit       _BIT_ACCESS(WDTPSL,1)
// WDTPSH<WDTPSCNT10>
extern volatile __bit                   WDTPSCNT10          __at(0x407A);	// @ (0x80F * 8 + 2)
#define                                 WDTPSCNT10_bit      _BIT_ACCESS(WDTPSH,2)
// WDTPSH<WDTPSCNT11>
extern volatile __bit                   WDTPSCNT11          __at(0x407B);	// @ (0x80F * 8 + 3)
#define                                 WDTPSCNT11_bit      _BIT_ACCESS(WDTPSH,3)
